package sec3;
//10개까지 은행계좌를 개설할 수 있는 account 배열 선언 => 은행계좌관리 시스템 구축
//bankName : 1.국민, 2.기업, 3.농협
//계좌번호 : 5자리숫자 정수
//1. 계좌등록 : 금융기과관, 예금주, 금액 등 입력하여 계좌생성
//			10개 초과시 등록 불가 메시지 출력, 번호는 0~9 5자리 정수 자동발생
//1. 입금 => 계좌, 입금액 처리 (해당계좌 없는 경우 계좌 등록으로 이동)
//2. 출금 => 계좌, 출금액 처리 (해당계좌 없는 경우 계좌 등록으로 이동)
//3. 잔액 조회 => 계좌 입력 시 계좌정보(은행, 예금주, 계좌번호, 잔액) 출력
//0. 작업종료
//1-3 작업 계속 반복수행, 0입력시 프로그램 종료
public class BankExam {

	public static void main(String[] args) {
		//계좌 배열 선언 => 10개 입력 (계좌번호, 예금주, 기관)
		
		
		//작업 반복 수행 (입금/출금/잔액조회/작업종료)

	}

}
